Repository: PhraseApp-Blog/flutter-phrase-ota-2021
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Heroes of Computer Science
ar: أبطال علوم الكمبيوتر

# bernersLeeBio
source: Inventor of the World Wide Web.
ar: مخترع شبكة الويب العالمية.

# bernersLeeName
source: Tim Berners-Lee
ar: تيم برنرز - لي

# gatesBio
source: Co-founder of {microsoft}; philanthropist.
ar: المؤسس المشارك لشركة {microsoft} ، محب الخير.

# gatesName
source: Bill Gates
ar: بيل جيتس

# heroBorn
source: Born {date}
ar: تاريخ الميلاد {date}

# heroCount
source: {count,plural, =0{No heroes yet} =1{1 hero} other{{count} heroes}}
ar: {count,plural, =0{لا توجد أبطال بعد} =1{بطل {count}} =2{بطلان} few{{count} أبطال} many{{count} بطل} other{{count} بطل}

# hopperBio
source: Devised theory of machine-independent programming languages.
ar: إبتكرت نظرية للغات البرمجة المستقلة عن الجهاز.

# hopperName
source: Grace Hopper
ar: جريس هوبر

# liskovBio
source: Turing Award winner; inventor of Liskov substitution principle.
ar: الفائزة بجائزة تورينج، مخترعة مبدأ استبدال ليسكوف.

# liskovName
source: Barbara Liskov
ar: باربرا ليسكوف

source: Open Settings
ar: إفتح الإعدادات

source: Settings
ar: الإعدادات

source: Settings Screen
ar: شاشة الإعدادات

# turingBio
source: Father of theoretical computer science & artificial intelligence.
ar: الأب الروحي لعلوم الكمبيوتر النظرية والذكاء الاصطناعي.

# turingName
source: Alan Turing
ar: آلان تورينج

# wozniakBio
source: Developed the {appleOne} & {appleTwo} microcomputers.
ar: طور جهازي كمبيوتر {appleOne} و {appleTwo}

# wozniakName
source: Steve Wozniak
ar: ستيف وزنياك
